In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("C:/Users/chait/Desktop/HR_Analytics_Personal/cleaned_HR_Employee_data.csv")

In [4]:
df.head()

,EmployeeID,FullName,Department,JobTitle,Email,Gender,HireDate,TerminationDate,Salary,ManagerID,PerformanceRating,Status
0,PNR-1001,Olivia Brown,Sales,Account Manager,employee.1001@pnrao.com,Non-binary,2024-05-10,NaN,177617.0,NaN,4.0,Active
1,PNR-1002,John Williams,Research & Development,Research Lead,employee.1002@pnrao.com,Female,2020-03-06,NaN,75932.0,PNR-40746,5.0,Active
2,PNR-1003,Olivia Singh,Quality Control,QC Manager,employee.1003@pnrao.com,Female,2025-10-14,NaN,179304.0,NaN,4.0,Active
3,PNR-1004,Chris Williams,Research & Development,Unknown,employee.1004@pnrao.com,Unknown,2019-02-22,2024-02-07,94033.0,PNR-40015,5.0,Terminated
4,PNR-1004,Chris Williams,Research & Development,Research Lead,employee.1004@pnrao.com,Female,2019-02-22,2024-02-07,94033.0,PNR-40015,5.0,Terminated

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49637 entries, 0 to 49636
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   EmployeeID         49637 non-null  object
 1   FullName           49637 non-null  object
 2   Department         49637 non-null  object
 3   JobTitle           49637 non-null  object
 4   Email              49637 non-null  object
 5   Gender             49637 non-null  object
 6   HireDate           38652 non-null  object
 7   TerminationDate    6656 non-null   object
 8   Salary             49637 non-null  float64
 9   ManagerID          34889 non-null  object
 10  PerformanceRating  49637 non-null  float64
 11  Status             49637 non-null  object
dtypes: float64(2), object(10)
memory usage: 4.5+ MB

In [6]:
#Distinct Employee count
total_employees = df['EmployeeID'].nunique()
total_employees

45275

In [7]:
#Total Active Employees
active_employees = df[df['Status'] == 'Active']['EmployeeID'].nunique()
active_employees

30186

In [8]:
#Total Terminated Employees
active_employees = df[df['Status'] == 'Terminated']['EmployeeID'].nunique()
active_employees

5330

In [9]:
#Total Unknowm status Employees
active_employees = df[df['Status'] == 'Unknown']['EmployeeID'].nunique()
active_employees

5374

In [10]:
#Active employees by department
active_by_department = (
    df[df['Status'] == 'Active']
    .groupby('Department')['EmployeeID']
    .nunique()
    .reset_index(name='Active_Employees')
    .sort_values(by='Active_Employees', ascending=False)
)

active_by_department

                  Department  Active_Employees
18                   Unknown              3522
13                 Marketing              2749
17                     Sales              2703
16    Research & Development              2695
14                Production              2687
11                IT Support              2652
10           Human Resources              2647
9                    Finance              2647
15           Quality Control              2623
12                 Logistics              2620
2                IT Support                424
3                 Logistics                407
6           Quality Control                402
1           Human Resources                386
7    Research & Development                383
8                     Sales                374
5                Production                373
4                 Marketing                359
0                   Finance                336

In [11]:
df['HireDate'] = pd.to_datetime(df['HireDate'], errors='coerce')
df['TerminationDate'] = pd.to_datetime(df['TerminationDate'], errors='coerce')
df['Salary'] = df['Salary'].astype(float)

In [12]:
df.dtypes

EmployeeID                   object
FullName                     object
Department                   object
JobTitle                     object
Email                        object
Gender                       object
HireDate             datetime64[ns]
TerminationDate      datetime64[ns]
Salary                      float64
ManagerID                    object
PerformanceRating           float64
Status                       object
dtype: object

In [13]:
#Change datatype while loading 
df = pd.read_csv(
    "C:/Users/chait/Desktop/HR_Analytics_Personal/cleaned_HR_Employee_data.csv",
    parse_dates=['HireDate', 'TerminationDate'],
    dtype={
        'EmployeeID': 'string',
        'Department': 'category',
        'Gender': 'category',
        'Status': 'category',
        'FullName': 'string',
        'JobTitle': 'string',
        'Email': 'string',
        'ManagerID': 'string'
        
    }
)

In [14]:
df.dtypes

EmployeeID           string[python]
FullName             string[python]
Department                 category
JobTitle             string[python]
Email                string[python]
Gender                     category
HireDate             datetime64[ns]
TerminationDate      datetime64[ns]
Salary                      float64
ManagerID            string[python]
PerformanceRating           float64
Status                     category
dtype: object

In [22]:
# Trim department values
df['Department'] = df['Department'].str.strip()

#Active employees by department
active_by_dept = (
    df[df['Status'] == 'Active']
    .groupby('Department')['EmployeeID']
    .count()
    .sort_values(ascending=False)
)

active_by_dept

Department
Unknown                   3522
Marketing                 3306
Research & Development    3296
Sales                     3288
IT Support                3287
Production                3271
Human Resources           3242
Logistics                 3239
Quality Control           3212
Finance                   3191
Name: EmployeeID, dtype: int64

In [15]:
#Yearly Employee Intake
df['Hire_Year'] = df['HireDate'].dt.year.astype('Int64')
df['Hire_Year'] = df['Hire_Year'].astype(str).replace('<NA>', 'Unknown')

yearly_hired_count = (
    df.groupby('Hire_Year')['EmployeeID']
    .nunique()
    .reset_index(name='Hired_Count')
    .sort_values('Hire_Year')
)

yearly_hired_count

  Hire_Year  Hired_Count
0      2018         4504
1      2019         4506
2      2020         4373
3      2021         4375
4      2022         4383
5      2023         4430
6      2024         4452
7      2025         4496
8      2026           25
9   Unknown        10985

In [21]:
#Gender wise avg_performance rating
df['Gender'] = df['Gender'].str.strip()

avg_perf_gender = (
    df[df['PerformanceRating'].notna()]
    .groupby('Gender')['PerformanceRating']
    .mean()
    .round(2)
    .sort_values(ascending=False)
)

avg_perf_gender

Gender
Non-binary    3.56
Male          3.55
Unknown       3.55
Female        3.54
Name: PerformanceRating, dtype: float64

In [23]:
# Trim Jobtitle values
df['JobTitle'] = df['JobTitle'].str.strip()

#Active employees by JobTitle
active_by_dept = (
    df[df['Status'] == 'Active']
    .groupby('JobTitle')['EmployeeID']
    .count()
    .sort_values(ascending=False)
)

active_by_dept

JobTitle
Unknown                   3395
QC Manager                1685
Warehouse Associate       1649
Logistics Coordinator     1625
QC Inspector              1564
Operations Manager        1168
Sales Associate           1141
Research Lead             1133
Digital Marketer          1127
Financial Analyst         1127
Account Manager           1123
Marketing Manager         1122
HR Coordinator            1106
IT Technician             1104
IT Manager                1099
Line Supervisor           1096
Help Desk Specialist      1092
HR Generalist             1087
Marketing Coordinator     1081
Scientist                 1069
Controller                1067
Recruiter                 1057
Lab Technician            1046
Regional Sales Manager    1037
Accountant                1029
Production Worker         1025
Name: EmployeeID, dtype: int64

In [26]:
today = pd.Timestamp.today()

#Average tenure
df['tenure_years'] = (
    (df['TerminationDate'].fillna(today) - df['HireDate'])
    .dt.days / 365
)

#average tenure for all the employees
avg_tenure_all = df['tenure_years'].mean().round(2)
avg_tenure_all

3.9

In [27]:
#Average tenure in years by gender
avg_tenure_gender = (
    df[df['HireDate'].notna()]
    .groupby('Gender')['tenure_years']
    .mean()
    .round(2)
    .sort_values(ascending=False)
)

avg_tenure_gender

Gender
Female        3.93
Male          3.91
Unknown       3.88
Non-binary    3.87
Name: tenure_years, dtype: float64

In [29]:
# Trim Jobtitle values
df['Department'] = df['Department'].str.strip()

#Active employees by JobTitle
term_by_dept = (
    df[df['Status'] == 'Terminated']
    .groupby('Department')['EmployeeID']
    .count()
    .sort_values(ascending=False)
)

term_by_dept

Department
Human Resources           626
Finance                   610
Sales                     589
Logistics                 582
Production                582
Research & Development    580
IT Support                579
Unknown                   566
Quality Control           557
Marketing                 551
Name: EmployeeID, dtype: int64

In [31]:
#Yearly Employee Terminated
df['Term_Year'] = df['TerminationDate'].dt.year.astype('Int64')
df['Term_Year'] = df['Term_Year'].astype(str).replace('<NA>', 'Unknown')

yearly_term_count = (
    df.groupby('Term_Year')['EmployeeID']
    .nunique()
    .reset_index(name='Term_Count')
    .sort_values('Term_Year')
)

yearly_term_count

   Term_Year  Term_Count
0       2018          16
1       2019         160
2       2020         263
3       2021         463
4       2022         637
5       2023         723
6       2024         802
7       2025         775
8       2026         711
9       2027         613
10      2028         456
11      2029         280
12      2030         165
13      2031          17
14   Unknown       39287

In [28]:
# Trim Jobtitle values
df['JobTitle'] = df['JobTitle'].str.strip()

#Terminated  employees by JobTitle
term_by_dept = (
    df[df['Status'] == 'Terminated']
    .groupby('JobTitle')['EmployeeID']
    .count()
    .sort_values(ascending=False)
)

term_by_dept

JobTitle
Unknown                   601
Logistics Coordinator     322
QC Manager                274
QC Inspector              273
Warehouse Associate       261
Production Worker         226
Recruiter                 224
HR Generalist             220
Accountant                210
Lab Technician            206
Account Manager           204
Financial Analyst         204
Operations Manager        202
IT Manager                197
Regional Sales Manager    197
Help Desk Specialist      192
HR Coordinator            190
Sales Associate           189
Controller                188
Digital Marketer          184
IT Technician             183
Research Lead             183
Scientist                 180
Marketing Coordinator     175
Marketing Manager         174
Line Supervisor           163
Name: EmployeeID, dtype: int64

In [32]:
#Average Salary
avg_salary = (
    df[df['Salary'].notna() & (df['Salary'] > 0)]
    ['Salary']
    .mean()
    .round(2)
)

avg_salary

89809.46

In [33]:
#Total employees left
employees_left = df['TerminationDate'].notna().sum()
total_employees = len(df)

#Attrition Rate(%)
attrition_rate = round((employees_left / total_employees) * 100, 2)
attrition_rate

13.41

In [34]:
#Attrition by Gender
attrition_by_gender = (
    df.groupby('Gender')
    .apply(lambda x: round(
        (x['TerminationDate'].notna().sum() / len(x)) * 100, 2
    ))
    .sort_values(ascending=False)
)

attrition_by_gender

C:\Users\chait\AppData\Local\Temp\ipykernel_39836\2386523220.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  .apply(lambda x: round(

Gender
Unknown       13.78
Male          13.43
Female        13.35
Non-binary    13.32
dtype: float64

In [35]:
#Create Salary Slab
bins = [0, 60000, 80000, 100000, 120000, 140000, 160000, float('inf')]
labels = [
    'Below 60K', '60K-79K', '80K-99K',
    '100K-119K', '120K-139K', '140K-159K', '160K+'
]

df['salary_slab'] = pd.cut(
    df['Salary'],
    bins=bins,
    labels=labels,
    right=False
)

df[['Salary', 'salary_slab']].head()

     Salary salary_slab
0  177617.0       160K+
1   75932.0     60K-79K
2  179304.0       160K+
3   94033.0     80K-99K
4   94033.0     80K-99K

In [37]:
#Attrition rate by salary slab
attrition_by_slab = (
    df[df['salary_slab'].notna()]
    .groupby('salary_slab')
    .agg(
        employee_count=('EmployeeID', 'count'),
        employees_left=('TerminationDate', lambda x: x.notna().sum())
    )
)

attrition_by_slab['attrition_rate_percent'] = (
    attrition_by_slab['employees_left']
    / attrition_by_slab['employee_count'] * 100
).round(2)

attrition_by_slab = attrition_by_slab.sort_index()

attrition_by_slab

C:\Users\chait\AppData\Local\Temp\ipykernel_39836\3117614674.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby('salary_slab')

             employee_count  employees_left  attrition_rate_percent
salary_slab
Below 60K              5430             721                   13.28
60K-79K               25980            3491                   13.44
80K-99K                5907             792                   13.41
100K-119K               849              99                   11.66
120K-139K              4001             557                   13.92
140K-159K              3691             468                   12.68
160K+                  3779             528                   13.97

In [38]:
#Attrition rate by gender
attrition_by_gender = (
    df[df['Gender'].notna()]
    .groupby('Gender')
    .agg(
        employee_count=('EmployeeID', 'count'),
        employees_left=('TerminationDate', lambda x: x.notna().sum())
    )
)

attrition_by_gender['attrition_rate_percent'] = (
    attrition_by_gender['employees_left']
    / attrition_by_gender['employee_count'] * 100
).round(2)

attrition_by_gender.sort_values(
    by='attrition_rate_percent',
    ascending=False
)

            employee_count  employees_left  attrition_rate_percent
Gender
Unknown               5428             748                   13.78
Male                 14781            1985                   13.43
Female               14761            1970                   13.35
Non-binary           14667            1953                   13.32

In [42]:
avg_salary_slab_gender = (
    df[df['Salary'].notna()]
    .groupby(['Gender', 'salary_slab'])
    .agg(
        employee_count=('EmployeeID', 'count'),
        avg_salary=('Salary', 'mean')
    )
    .round(2)
    .sort_index()
)

avg_salary_slab_gender

C:\Users\chait\AppData\Local\Temp\ipykernel_39836\1036504327.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(['Gender', 'salary_slab'])

                        employee_count  avg_salary
Gender     salary_slab
Female     Below 60K              1630    57583.12
           60K-79K                7758    71013.82
           80K-99K                1738    83439.72
           100K-119K               246   110906.24
           120K-139K              1161   129472.57
           140K-159K              1139   149623.54
           160K+                  1089   169689.04
Male       Below 60K              1597    57477.22
           60K-79K                7721    71003.91
           80K-99K                1771    83455.42
           100K-119K               249   109056.49
           120K-139K              1245   129494.06
           140K-159K              1102   150147.39
           160K+                  1096   170062.75
Non-binary Below 60K              1608    57477.48
           60K-79K                7584    71004.21
           80K-99K                1744    83274.97
           100K-119K               273   109916.48
           120K-139K              1211   129577.87
           140K-159K              1067   150079.40
           160K+                  1180   170069.69
Unknown    Below 60K               595    57639.81
           60K-79K                2917    71306.27
           80K-99K                 654    83232.94
           100K-119K                81   109339.42
           120K-139K               384   130171.25
           140K-159K               383   149333.48
           160K+                   414   170423.61